### DCB Bank - Interview Project

#### Task 1
**Read the accompanied `input.xlsx` file as a pandas dataframe.** 

While reading the file, make sure of the following:
* The first column (Sl No) should be read as the index
* The first two rows shall be read as column headers
* All columns should be read as strings and shall be converted later to other data format as and when required

In [9]:
import pandas as pd

# ToDo - complete the following line of code
df = pd.read_excel('input.xlsx', index_col = 0, header=[0,1], dtype=str)

# Do Not Change this part
display(df.head())

      Unnamed: 1_level_0 Unnamed: 2_level_0 Unnamed: 3_level_0  \
Sl No            Cust ID               Name       Onboard Date
1.0          11122233343        Random Name         15-05-2015
2.0          11122233344  Other Random Name         13-11-2007
NaN                  NaN                NaN                NaN
NaN                  NaN                NaN                NaN
NaN                  NaN                NaN                NaN

      Unnamed: 4_level_0 Unnamed: 5_level_0           Acc 1                  \
Sl No             PAN No             Mobile          Acc No Acc Type    Bal
1.0           AAAAA1111A      +919999988888  11112222333344   Saving   1000
2.0           BBBBB1222B         9988776655  20198756473678     Term  50000
NaN                  NaN                NaN             NaN      NaN    NaN
NaN                  NaN                NaN             NaN      NaN    NaN
NaN                  NaN                NaN             NaN      NaN    NaN

                Acc 2                 Acc 3                Acc 4
Sl No          Acc No Acc Type   Bal Acc No Acc Type  Bal Acc No Acc Type  Bal
1.0    11112223345678  Current  -375    NaN      NaN  NaN    NaN      NaN  NaN
2.0               NaN      NaN   NaN    NaN      NaN  NaN    NaN      NaN  NaN
NaN               NaN      NaN   NaN    NaN      NaN  NaN    NaN      NaN  NaN
NaN               NaN      NaN   NaN    NaN      NaN  NaN    NaN      NaN  NaN
NaN               NaN      NaN   NaN    NaN      NaN  NaN    NaN      NaN  NaN

#### Task 2
**Remove all Empty Rows.**

Empty rows shall be identified using the `index`, i.e. whenever the index is `NaN`, remove such rows

In [11]:
# ToDo - Complete the following line of code
df = df.loc[df.index.notnull()]

display(df)

      Unnamed: 1_level_0 Unnamed: 2_level_0 Unnamed: 3_level_0  \
Sl No            Cust ID               Name       Onboard Date
1.0          11122233343        Random Name         15-05-2015
2.0          11122233344  Other Random Name         13-11-2007

      Unnamed: 4_level_0 Unnamed: 5_level_0           Acc 1                  \
Sl No             PAN No             Mobile          Acc No Acc Type    Bal
1.0           AAAAA1111A      +919999988888  11112222333344   Saving   1000
2.0           BBBBB1222B         9988776655  20198756473678     Term  50000

                Acc 2                 Acc 3                Acc 4
Sl No          Acc No Acc Type   Bal Acc No Acc Type  Bal Acc No Acc Type  Bal
1.0    11112223345678  Current  -375    NaN      NaN  NaN    NaN      NaN  NaN
2.0               NaN      NaN   NaN    NaN      NaN  NaN    NaN      NaN  NaN

#### Task 3
**Separate the dataframe into two different dataframes. The first shall contain first 5 columns, while the second will contain rest**

In [14]:
# ToDo Complete following line of Code
cust_info, acc_info = df.iloc[:,:5], df.iloc[:,5:]

#### Task 4
**Change the column headers**
* While renaming the column headers of `cust_info`, we will simply convert the headers into lower case and replace **space** with **underscore**